ArminJo/ESP32-Cam-Sewer-inspection-car/ESP32-Cam-Sewer-inspection-car/ESP32-Cam-Sewer-inspection-car.ino
/*
 * esp32-cam-webserver.cpp
 *
 * This sketch is based on esp32-cam-webserver by Owen Carter.
 * This in turn is based on the 'official' ESP32 Camera example sketch from Expressif:
 *  https://github.com/espressif/arduino-esp32/tree/master/libraries/ESP32/examples/Camera/CameraWebServer
 *
 *  Extensions by me:
 *  - Support a pan servo for the ESP32-Cam.
 *  - Support motor control with adjustable speed / power and going fixed distances.
 *  - ESP32 core 3.x adaption.
 *  - Support of missing PSRAM - with restricted resolution / quality.
 *  - Display of fps stream rate in Browser.
 *  - Improved documentation.
 *
 *  Features of Owen Carters version
 *
 *  - More options for default network and camera settings
 *  - Save and restore settings
 *  - Control of on-board lamps, rotate the view in the browser
 *  - Dedicated standalone stream viewer
 *  - Over The Air firmware updates
 *  - Lots of minor fixes and tweaks, documentation etc.
 *  - And 'reduced' by removing the Face Recognition features
 *
 *  Copyright (C) 2021-2024  Armin Joachimsmeyer
 *  armin.joachimsmeyer@gmail.com
 *
 *  This file is available at https://github.com/ArminJo/ESP32-Cam-Sewer-inspection-car.
 *
 *  ESP32-Cam-Sewer-inspection-car is free software: you can redistribute it and/or modify
 *  it under the terms of the GNU General Public License as published by
 *  the Free Software Foundation, either version 3 of the License, or
 *  (at your option) any later version.
 *
 *  This program is distributed in the hope that it will be useful,
 *  but WITHOUT ANY WARRANTY; without even the implied warranty of
 *  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
 *  See the GNU General Public License for more details.
 *
 *  You should have received a copy of the GNU General Public License
 *  along with this program.  If not, see <http://www.gnu.org/licenses/gpl.html>.
 */

/* 
 *  FOR NETWORK AND HARDWARE SETTINGS COPY OR RENAME 'myconfig.sample.h' TO 'myconfig.h' AND EDIT THAT.
 *
 * By default this sketch will assume an AI-THINKER ESP-CAM and create
 * an accesspoint called "ESP32-CAM-CONNECT" (password: "InsecurePassword")
 *
 */

#include <Arduino.h>

#include "esp32-cam-webserver.h"

#include <esp_camera.h>
#include <esp_task_wdt.h>
#include <WiFi.h>
#include <DNSServer.h>
#include <ArduinoOTA.h>
#include "parsebytes.h"
#include "time.h"
#if ESP_ARDUINO_VERSION >= 0x030000 // ESP_ARDUINO_VERSION_VAL(3, 0, 0), ESP_ARDUINO_VERSION_VAL disturbs the auto formatting :-(
#include "esp_private/periph_ctrl.h"
#endif

/*
 * Enable / disable extensions
 * Definitions are in MotorAndServoControl.hpp
 */
#define PAN_SERVO_SUPPORT   // on pin 12
#if defined(PAN_SERVO_SUPPORT)
const bool sPanServoIsSupported = true;
#else
const bool sPanServoIsSupported = false;
#endif

#define ONE_PWM_MOTOR_SUPPORT   // on pin 13
#if defined(ONE_PWM_MOTOR_SUPPORT)
const bool sOnePWMMotorIsSupported = true;
#else
const bool sOnePWMMotorIsSupported = false;
#endif
#if defined(PAN_SERVO_SUPPORT) || defined(ONE_PWM_MOTOR_SUPPORT)
#define DO_NOT_SUPPORT_RAMP // Ramps are anyway not used if drive speed voltage (default 2.0 V) is below 2.3 V. Saves 378 bytes program memory.
#include "MotorAndServoControl.h"
#else
/*
 * Helper macro for getting a macro definition as string
 */
#  if !defined(STR_HELPER)
#define STR_HELPER(x) #x
#define STR(x) STR_HELPER(x)
#  endif
#endif

#define VERSION_EXAMPLE 1.0

/*
 * Include myconfig.h if available, otherwise we set defaults below
 */
// Primary config, or defaults.
#if __has_include("myconfig.h")
struct station {
    const char ssid[65];
    const char password[65];
    const bool dhcp;
};
// do no edit
#include "myconfig.h"
#else
#warning "Using Defaults: Copy myconfig.sample.h to myconfig.h and edit that to use your own settings"
#define WIFI_AP_ENABLE
#define CAMERA_MODEL_AI_THINKER
struct station {
    const char ssid[65];
    const char password[65];
    const bool dhcp;
} stationList[] = { { "ESP32-CAM-CONNECT", "InsecurePassword", true } };

#endif

// Pin Mappings
#include "camera_pins.h"

int sNumberOfFramebuffer = 2; // use 2 framebuffers if PSRAM is available, more than 2 does not increase the fps
/*
 * Configuration also contained in myconfig.h
 */
//#define LED_DISABLE       // Uncomment to disable the notification LED on the module
//#define LAMP_DISABLE      // Uncomment to disable the illumination lamp features
//#define LAMP_DEFAULT 0    // Define the startup lamp power setting (as a percentage, defaults to 0%)
//#define DEFAULT_INDEX_FULL // Default Page: uncomment to make the full control page the default, otherwise show simple viewer
//#define WIFI_AP_ENABLE    // Uncomment to enable AP mode
//#define AP_ADDRESS 192,168,4,2 // Change the AccessPoint ip address (default = 192.168.4.1)
//#define NO_OTA
//#define OTA_PASSWORD "SuperVisor"
//#define CAM_ROTATION 0 // one of 0, 90, -90
//#define CAM_NAME "ESP32-CAM-Robot-Car" // The camera name for the web interface
// Illumination LAMP and status LED
#if defined(LAMP_DISABLE)
int lampBrightnessPercentage = -1;  // lamp is disabled in config
#elif defined(LAMP_PIN)
#  if defined(LAMP_DEFAULT)
int lampBrightnessPercentage = constrain(LAMP_DEFAULT,0,100); // initial lamp value, range 0-100
#  else
int lampBrightnessPercentage = 0;   //default to off
#  endif
#else
int lampBrightnessPercentage = -1;  // no lamp pin assigned
#endif

bool autoLampValue = false;         // Start value of Auto Lamp Switch on GUI (auto on while camera running)

#if defined(LED_DISABLE)
#undef LED_PIN    // undefining this disables the notification LED
#endif

#if defined(CAM_NAME)
const char sApplicationName[] = CAM_NAME;
#else
const char sApplicationName[] = "ESP32 robot camera";
#endif
// initial rotation
// can be set in myconfig.h
#if !defined(CAM_ROTATION)
#define CAM_ROTATION 0
#endif
int myRotation = CAM_ROTATION;

/*
 * Setting values and defaults for defines included in myconfig.h
 */
// Ports for http and stream (override in myconfig.h)
#if defined(HTTP_PORT)
int httpPort = HTTP_PORT;
#else
int httpPort = 80;
#endif
#if defined(STREAM_PORT)
int streamPort = STREAM_PORT;
#else
int streamPort = 81;
#endif
#if !defined(WIFI_WATCHDOG)
#define WIFI_WATCHDOG 8000
#endif

// Select between full and simple index as the default.
#if defined(DEFAULT_INDEX_FULL)
char default_index[] = "full";
#else
char default_index[] = "simple";
#endif

