ArminJo/ESP32-Cam-Sewer-inspection-car/ESP32-Cam-Sewer-inspection-car/ESP32-Cam-Sewer-inspection-car.ino
#if defined(NO_FS)
bool filesystem = false;
#else
bool filesystem = true;
#endif
#if defined(NO_OTA)
bool otaEnabled = false;
#else
bool otaEnabled = true;
#endif
#if defined(OTA_PASSWORD)
char otaPassword[] = OTA_PASSWORD;
#else
char otaPassword[] = "";
#endif
#if defined(NTPSERVER)
bool haveTime = true;
const char* ntpServer = NTPSERVER;
const long  gmtOffset_sec = NTP_GMT_OFFSET;
const int   daylightOffset_sec = NTP_DST_OFFSET;
#else
bool haveTime = false;
const char *ntpServer = "";
const long gmtOffset_sec = 0;
const int daylightOffset_sec = 0;
#endif

// Internal filesystem (SPIFFS)
// used for non-volatile camera settings
#include "storage.h"

// Sketch Info
int sketchSize;
int sketchSpace;
String sketchMD5;

// Number of known networks in stationList[] which is defined in myconfig.h
int stationCount = sizeof(stationList) / sizeof(stationList[0]);

// Start with accesspoint mode disabled, wifi setup will activate it if
// no known networks are found, and WIFI_AP_ENABLE has been defined
bool sInAccesspointMode = false;
// If we have AP mode enabled, ignore first entry in the stationList[]
#if defined(WIFI_AP_ENABLE) // 4 simultaneous connections in AP mode
int firstStation = 1;
#else
int firstStation = 0;
#endif

// IP address, Netmask and Gateway, populated when connected
IPAddress ip;
IPAddress net;
IPAddress gw;

// Declare external function from app_httpd.cpp
extern void startCameraServer(int hPort, int sPort);
extern void serialDump();

const char sExampleVersion[] = STR(VERSION_EXAMPLE);
const char sCompileTimestamp[] = __DATE__ " " __TIME__; // for serialDump() etc.

// DNS server
const byte DNS_PORT = 53;
DNSServer dnsServer;
bool sCaptivePortalEnabled = false; // 4 simultaneous connections in AP mode
char apName[64] = "Undefined";

// The app and stream URLs
char httpURL[64] = { "Undefined" };
char streamURL[64] = { "Undefined" };

// Counters for info screens and debug
int8_t streamCount = 0;          // Number of currently active streams
unsigned long streamsServed = 0; // Total completed streams
unsigned long imagesServed = 0;  // Total image requests

// Camera module bus communications frequency.
// Originally: config.xclk_freq_hz = 20000000, but this lead to visual artifacts on many modules.
// See https://github.com/espressif/esp32-camera/issues/150#issuecomment-726473652 et al.
#if !defined (XCLK_FREQ_HZ)
#define XCLK_FREQ_HZ 16500000
#endif

const int lampChannel = 2; // a free PWM channel (channel 0 used by Servo, channel 4 used by PWMMotor and maybe some channels used by camera)
const int lampPWMFrequency = 1000;  // 1K pwm frequency
const int lampPWMResolution = 9;    // duty cycle bit range for lamp
const int lampPWMMax = pow(2, lampPWMResolution) - 1;

// Critical error string; if set during init (camera hardware failure) it
// will be returned for all http requests
String critERR = "";

// Debug flag for stream and capture data
bool debugData;

void debugOn() {
    debugData = true;
    Serial.println("Camera debug data is enabled (send 'd' for status dump, or any other char to disable debug)");
}

void debugOff() {
    debugData = false;
    Serial.println("Camera debug data is disabled (send 'd' for status dump, or any other char to enable debug)");
}

// Serial input (debugging controls)
void handleSerial() {
    if (Serial.available()) {
        char cmd = Serial.read();
        if (cmd == 'd') {
            serialDump();
        } else {
            if (debugData)
                debugOff();
            else
                debugOn();
        }
    }
    while (Serial.available())
        Serial.read();  // chomp the buffer
}

// Notification LED 
void flashLED(int flashtime) {
#if defined(LED_PIN )               // If we have it; flash it.
    digitalWrite(LED_PIN, LED_ON);  // On at full power.
    delay(flashtime);               // delay
    digitalWrite(LED_PIN, LED_OFF); // turn Off
#else
    return;                         // No notifcation LED, do nothing, no delay
#endif
}

// Lamp Control
void setLamp(int aNewPercent) {
#if defined(LAMP_PIN)
    if (aNewPercent != -1) {
        // Apply a logarithmic function to the scale.
        int brightness = pow(aNewPercent / 100.0, 2.6) * lampPWMMax + 0.5; // 2.6 is gamma - can be also 3.3...
//        Serial.print("newVal / 100.0 = ");
//        Serial.print(aNewPercent / 100.0);
//        Serial.print(" pow=");
//        Serial.print(pow(aNewPercent / 100.0, 2.6));
//        Serial.print(" pwmMax=");
//        Serial.println(lampPWMMax);
#  if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
        ledcWrite(LAMP_PIN, brightness);
#  else
        ledcWrite(lampChannel, brightness);
#  endif
        Serial.print("Lamp: ");
        Serial.print(aNewPercent);
        Serial.print("%, pwm = ");
        Serial.println(brightness);
    }
#endif
}

void printLocalTime(bool extraData = false) {
    struct tm timeinfo;
    if (!getLocalTime(&timeinfo)) {
        Serial.println("Failed to obtain time");
    } else {
        Serial.println(&timeinfo, "%H:%M:%S, %A, %B %d %Y");
    }
    if (extraData) {
        Serial.printf("NTP Server: %s, GMT Offset: %li(s), DST Offset: %i(s)\r\n", ntpServer, gmtOffset_sec, daylightOffset_sec);
    }
}

void calcURLs() {
    // Set the URL's
#if defined(URL_HOSTNAME)
    if (httpPort != 80) {
        sprintf(httpURL, "http://%s:%d/", URL_HOSTNAME, httpPort);
    } else {
        sprintf(httpURL, "http://%s/", URL_HOSTNAME);
    }
    sprintf(streamURL, "http://%s:%d/", URL_HOSTNAME, streamPort);
#else
    Serial.println("Setting httpURL");
    if (httpPort != 80) {
        sprintf(httpURL, "http://%d.%d.%d.%d:%d/", ip[0], ip[1], ip[2], ip[3], httpPort);
    } else {
        sprintf(httpURL, "http://%d.%d.%d.%d/", ip[0], ip[1], ip[2], ip[3]);
    }
    sprintf(streamURL, "http://%d.%d.%d.%d:%d/", ip[0], ip[1], ip[2], ip[3], streamPort);
#endif
}

void WifiSetup() {
    // Feedback that we are now attempting to connect
    flashLED(300);
    delay(100);
    flashLED(300);
    Serial.println("Starting WiFi");

    // Disable power saving on WiFi to improve responsiveness 
    // (https://github.com/espressif/arduino-esp32/issues/1484)
    WiFi.setSleep(false);

    Serial.print("Known external SSIDs: ");
    if (stationCount > firstStation) {
        for (int i = firstStation; i < stationCount; i++)
            Serial.printf(" '%s'", stationList[i].ssid);
    } else {
        Serial.print("None");
    }
    Serial.println();
    byte mac[6] = { 0, 0, 0, 0, 0, 0 };
    WiFi.macAddress(mac);
    Serial.printf("MAC address: %02X:%02X:%02X:%02X:%02X:%02X\r\n", mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);

    int bestStation = -1;
    long bestRSSI = -1024;
    char bestSSID[65] = "";
    uint8_t bestBSSID[6];
    if (stationCount > firstStation) {
        // We have a list to scan 
        Serial.printf("Scanning local Wifi Networks\r\n");
        int stationsFound = WiFi.scanNetworks();
        Serial.printf("%i networks found\r\n", stationsFound);
        if (stationsFound > 0) {
            for (int i = 0; i < stationsFound; ++i) {
                // Print SSID and RSSI for each network found
                String thisSSID = WiFi.SSID(i); // call method of WiFiScanClass
                int thisRSSI = WiFi.RSSI(i);
                String thisBSSID = WiFi.BSSIDstr(i);
                Serial.printf("%3i : [%s] %s (%i)", i + 1, thisBSSID.c_str(), thisSSID.c_str(), thisRSSI);
                // Scan our list of known external stations
                for (int sta = firstStation; sta < stationCount; sta++) {
                    if ((strcmp(stationList[sta].ssid, thisSSID.c_str()) == 0)
                            || (strcmp(stationList[sta].ssid, thisBSSID.c_str()) == 0)) {
                        Serial.print("  -  Known!");
                        // Chose the strongest RSSI seen
                        if (thisRSSI > bestRSSI) {
                            bestStation = sta;
                            strncpy(bestSSID, thisSSID.c_str(), 64);
                            // Convert char bssid[] to a byte array
                            parseBytes(thisBSSID.c_str(), ':', bestBSSID, 6, 16);
                            bestRSSI = thisRSSI;
                        }
                    }
                }
                Serial.println();
            }
        }
    } else {
        // No list to scan, therefore we are an accesspoint
        sInAccesspointMode = true;
    }

    if (bestStation == -1) {
        if (!sInAccesspointMode) {
#if defined(WIFI_AP_ENABLE)
            Serial.println("No known networks found, entering AccessPoint fallback mode");
            sInAccesspointMode = true;
#else
            Serial.println("No known networks found");
#endif
        } else {
            Serial.println("AccessPoint mode selected in config");
        }
    } else {
        Serial.printf("Connecting to Wifi Network %d: [%02X:%02X:%02X:%02X:%02X:%02X] %s \r\n", bestStation, bestBSSID[0],
                bestBSSID[1], bestBSSID[2], bestBSSID[3], bestBSSID[4], bestBSSID[5], bestSSID);
        // Apply static settings if necessary
        if (stationList[bestStation].dhcp == false) {
#if defined(ST_IP)
            Serial.println("Applying static IP settings");
#  if !defined (ST_GATEWAY)  || !defined (ST_NETMASK)
#  error "You must supply both Gateway and NetMask when specifying a static IP address"
#  endif
            IPAddress staticIP(ST_IP);
            IPAddress gateway(ST_GATEWAY);
            IPAddress subnet(ST_NETMASK);
#  if !defined(ST_DNS1)
            WiFi.config(staticIP, gateway, subnet);
#  else
            IPAddress dns1(ST_DNS1);
#    if !defined(ST_DNS2)
            WiFi.config(staticIP, gateway, subnet, dns1);
#    else
            IPAddress dns2(ST_DNS2);
            WiFi.config(staticIP, gateway, subnet, dns1, dns2);
#    endif
#  endif
#else
            Serial.println("Static IP settings requested but not defined in config, falling back to dhcp");
#endif // defined(ST_IP)
        }

