ArminJo/ESP32-Cam-Sewer-inspection-car/ESP32-Cam-Sewer-inspection-car/ESP32-Cam-Sewer-inspection-car.ino
#if defined(HOSTNAME)
        WiFi.setHostname(HOSTNAME);
#endif

        // Initiate network connection request (3rd argument, channel = 0 is 'auto')
        WiFi.begin(bestSSID, stationList[bestStation].password, 0, bestBSSID);

        // Wait to connect, or timeout
        unsigned long start = millis();
        while ((millis() - start <= WIFI_WATCHDOG) && (WiFi.status() != WL_CONNECTED)) {
            delay(500);
            Serial.print('.');
        }
        // If we have connected, inform user
        if (WiFi.status() == WL_CONNECTED) {
            Serial.println("Client connection succeeded");
            sInAccesspointMode = false;
            // Note IP details
            ip = WiFi.localIP();
            net = WiFi.subnetMask();
            gw = WiFi.gatewayIP();
            Serial.printf("IP address: %d.%d.%d.%d\r\n", ip[0], ip[1], ip[2], ip[3]);
            Serial.printf("Netmask   : %d.%d.%d.%d\r\n", net[0], net[1], net[2], net[3]);
            Serial.printf("Gateway   : %d.%d.%d.%d\r\n", gw[0], gw[1], gw[2], gw[3]);
            calcURLs();
            // Flash the LED 4 times to show we are connected
            for (int i = 0; i < 4; i++) {
                flashLED(50);
                delay(250);
            }
        } else {
            Serial.println("Client connection Failed");
            WiFi.disconnect();   // (resets the WiFi scan)
        }
    }

    if (sInAccesspointMode && (WiFi.status() != WL_CONNECTED)) {
        // The accesspoint has been enabled, and we have not connected to any existing networks
#if defined(AP_CHAN)
        Serial.println("Setting up Fixed Channel AccessPoint");
        Serial.print("  SSID     : ");
        Serial.println(stationList[0].ssid);
        Serial.print("  Password : ");
        Serial.println(stationList[0].password);
        Serial.print("  Channel  : ");
        Serial.println(AP_CHAN);
        WiFi.softAP(stationList[0].ssid, stationList[0].password, AP_CHAN);
#else
        Serial.println("Setting up AccessPoint");
        Serial.print("  SSID     : ");
        Serial.println(stationList[0].ssid);
        Serial.print("  Password : ");
        Serial.println(stationList[0].password);
        if (strlen(stationList[0].password) == 0) {
            WiFi.softAP(stationList[0].ssid, NULL);
        } else {
            WiFi.softAP(stationList[0].ssid, stationList[0].password);
        }
#endif
#if defined(AP_ADDRESS)
        // User has specified the AP details; apply them after a short delay
        // (https://github.com/espressif/arduino-esp32/issues/985#issuecomment-359157428)
        delay(100);
        IPAddress local_IP(AP_ADDRESS);
        IPAddress gateway(AP_ADDRESS);
        IPAddress subnet(255,255,255,0);
        WiFi.softAPConfig(local_IP, gateway, subnet);
#endif
        // Note AP details
        ip = WiFi.softAPIP();
        net = WiFi.subnetMask();
        gw = WiFi.gatewayIP();
//        strcpy(apName, WiFi.SSID().c_str());  // is empty :-(
        strcpy(apName, stationList[0].ssid);
        Serial.printf("IP address: %d.%d.%d.%d\r\n", ip[0], ip[1], ip[2], ip[3]);
        calcURLs();
        // Flash the LED to show we are connected
        for (int i = 0; i < 5; i++) {
            flashLED(150);
            delay(50);
        }
        // Start the DNS captive portal if requested
        if (stationList[0].dhcp == true) {
            Serial.println("Starting Captive Portal");
            dnsServer.start(DNS_PORT, "*", ip);
            sCaptivePortalEnabled = true;
        }
    }
}
void setup() {
#if defined(LED_PIN)  // If we have a notification LED, set it to output
    pinMode(LED_PIN, OUTPUT);
    digitalWrite(LED_PIN, LED_ON);
#endif
#if defined(LAMP_PIN)
    // let LED flash
    pinMode(LAMP_PIN, OUTPUT);
    digitalWrite(LAMP_PIN, HIGH);
#endif

    Serial.begin(115200);
//    Serial.setDebugOutput(true);
    Serial.println("START " __FILE__ "\r\nVersion " STR(VERSION_EXAMPLE) " from " __DATE__ " " __TIME__);

#if defined(LAMP_PIN)
    // end of lamp flash
    digitalWrite(LAMP_PIN, LOW);
#endif

    if (stationCount == 0) {
        Serial.println("\r\nFatal Error; Halting");
        while (true) {
            Serial.println(
                    "No wifi details have been configured; we cannot connect to existing WiFi or start our own AccessPoint, there is no point in proceeding.");
            delay(5000);
        }
    }

#if defined(LED_PIN)  // If we have a notification LED, set it to output
    pinMode(LED_PIN, OUTPUT);
    digitalWrite(LED_PIN, LED_ON);
#endif

    // Create camera config structure; and populate with hardware and other defaults 
    camera_config_t config;
    config.ledc_channel = LEDC_CHANNEL_0;
    config.ledc_timer = LEDC_TIMER_0;
    config.pin_d0 = Y2_GPIO_NUM;
    config.pin_d1 = Y3_GPIO_NUM;
    config.pin_d2 = Y4_GPIO_NUM;
    config.pin_d3 = Y5_GPIO_NUM;
    config.pin_d4 = Y6_GPIO_NUM;
    config.pin_d5 = Y7_GPIO_NUM;
    config.pin_d6 = Y8_GPIO_NUM;
    config.pin_d7 = Y9_GPIO_NUM;
    config.pin_xclk = XCLK_GPIO_NUM;
    config.pin_pclk = PCLK_GPIO_NUM;
    config.pin_vsync = VSYNC_GPIO_NUM;
    config.pin_href = HREF_GPIO_NUM;
#  if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
    config.pin_sccb_sda = SIOD_GPIO_NUM;
    config.pin_sccb_scl = SIOC_GPIO_NUM;
#else
    config.pin_sscb_sda = SIOD_GPIO_NUM;
    config.pin_sscb_scl = SIOC_GPIO_NUM;
#endif
    config.pin_pwdn = PWDN_GPIO_NUM;
    config.pin_reset = RESET_GPIO_NUM;
    config.xclk_freq_hz = XCLK_FREQ_HZ;
    config.pixel_format = PIXFORMAT_JPEG;
    // Pre-allocate large buffers
    if (psramFound()) {
        config.frame_size = FRAMESIZE_UXGA;
        config.jpeg_quality = 10; //0-63 lower number means higher quality
        /*
         * Frame buffer count also used for stills :-(
         */
        config.fb_count = sNumberOfFramebuffer; // two are required to double the frame rate, more makes no sense
        Serial.printf("PSRAM detected. Set %u framebuffer for UXGA and quality %u", config.fb_count, config.jpeg_quality);
    } else {
        /*
         * Maximum quality without PSRAM: SVGA: 6 (Maximum), XGA: 9, HD: 10, SXGA: 16, UXGA: 27
         * This depends on the content of the picture, which determine its size, and thus may not fit into our buffer with these quality settings..
         * Then try the next lower setting.
         */
        config.fb_location = CAMERA_FB_IN_DRAM;
        config.frame_size = FRAMESIZE_VGA;
        config.jpeg_quality = 6;
        config.fb_count = 1;
        sNumberOfFramebuffer = 1;
        Serial.printf("No PSRAM found. Set %u framebuffer for VGA and quality to %u.\r\n", config.fb_count, config.jpeg_quality);
        Serial.printf("High resolution/quality images & streams will show incomplete frames due to low memory.\r\n");
    }

#if defined(CAMERA_MODEL_ESP_EYE)
    pinMode(13, INPUT_PULLUP);
    pinMode(14, INPUT_PULLUP);
#endif

    // camera init
    esp_err_t err = esp_camera_init(&config);
    if (err != ESP_OK) {
        delay(100);  // need a delay here or the next serial o/p gets missed
        Serial.printf("\r\n\r\nCRITICAL FAILURE: Camera sensor failed to initialise.\r\n\r\n");
        Serial.printf("A full (hard, power off/on) reboot will probably be needed to recover from this.\r\n");
        Serial.printf("Meanwhile; this unit will reboot in 1 minute since these errors sometime clear automatically\r\n");
        // Reset the I2C bus.. may help when rebooting. See https://esp32.com/viewtopic.php?t=3152
        periph_module_disable(PERIPH_I2C0_MODULE); // try to shut I2C down properly in case that is the problem
        periph_module_disable(PERIPH_I2C1_MODULE);
        periph_module_reset(PERIPH_I2C0_MODULE);
        periph_module_reset(PERIPH_I2C1_MODULE);
        // And set the error text for the UI
        critERR = "<h1>Error!</h1><hr><p>Camera module failed to initialise!</p><p>Please reset (power off/on) the camera.</p>";
        critERR += "<p>We will continue to reboot once per minute since this error sometimes clears automatically.</p>";
        // Start a 60 second watchdog timer
#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
        esp_task_wdt_config_t twdt_config = { .timeout_ms = 60000, .idle_core_mask = 0x03,    // Bitmask of all cores
                .trigger_panic = true, };
        esp_task_wdt_init(&twdt_config);  // schedule a a watchdog panic event for 3 seconds in the future
#else
        esp_task_wdt_init(60, true);
#endif
        esp_task_wdt_add(NULL);
    } else {
        Serial.println("Camera init succeeded");

        // Get a reference to the sensor
        sensor_t *s = esp_camera_sensor_get();

        // Dump camera module, warn for unsupported modules.
        switch (s->id.PID) {
        case OV9650_PID:
            Serial.println("WARNING: OV9650 camera module is not properly supported, will fallback to OV2640 operation");
            break;
        case OV7725_PID:
            Serial.println("WARNING: OV7725 camera module is not properly supported, will fallback to OV2640 operation");
            break;
        case OV2640_PID:
            Serial.println("OV2640 camera module detected");
            break;
        case OV3660_PID:
            Serial.println("OV3660 camera module detected");
            break;
        default:
            Serial.println("WARNING: Camera module is unknown and not properly supported, will fallback to OV2640 operation");
        }

        // OV3660 initial sensors are flipped vertically and colors are a bit saturated
        if (s->id.PID == OV3660_PID) {
            s->set_vflip(s, 1);  //flip it back
            s->set_brightness(s, 1);  //up the blightness just a bit
            s->set_saturation(s, -2);  //lower the saturation
        }
#if defined(PAN_SERVO_SUPPORT)
        if (s->id.PID == OV2640_PID) {
            s->set_hmirror(s, 1);  //flip it top down
            s->set_vflip(s, 1);  //flip it back
        }
#endif
        // M5 Stack Wide has special needs
#if defined(CAMERA_MODEL_M5STACK_WIDE)
        s->set_vflip(s, 1);
        s->set_hmirror(s, 1);
#endif

