ArminJo/ESP32-Cam-Sewer-inspection-car/ESP32-Cam-Sewer-inspection-car/ESP32-Cam-Sewer-inspection-car.ino
        // Config can override mirror and flip
#if defined(H_MIRROR)
        s->set_hmirror(s, H_MIRROR);
#endif
#if defined(V_FLIP)
        s->set_vflip(s, V_FLIP);
#endif

        // set initial frame rate
#if defined(DEFAULT_RESOLUTION)
        s->set_framesize(s, DEFAULT_RESOLUTION);
#else
        s->set_framesize(s, FRAMESIZE_SVGA);
#endif

        /*
         * Add any other defaults you want to apply at startup here:
         * uncomment the line and set the value as desired (see the comments)
         *
         * these are defined in the esp headers here:
         * https://github.com/espressif/esp32-camera/blob/master/driver/include/sensor.h#L149
         */

        //s->set_framesize(s, FRAMESIZE_SVGA); // FRAMESIZE_[QQVGA|HQVGA|QVGA|CIF|VGA|SVGA|XGA|SXGA|UXGA|QXGA(ov3660)]);
        //s->set_quality(s, val);       // 10 to 63
        //s->set_brightness(s, 0);      // -2 to 2
        //s->set_contrast(s, 0);        // -2 to 2
        //s->set_saturation(s, 0);      // -2 to 2
        //s->set_special_effect(s, 0);  // 0 to 6 (0 - No Effect, 1 - Negative, 2 - Grayscale, 3 - Red Tint, 4 - Green Tint, 5 - Blue Tint, 6 - Sepia)
        //s->set_whitebal(s, 1);        // aka 'awb' in the UI; 0 = disable , 1 = enable
        //s->set_awb_gain(s, 1);        // 0 = disable , 1 = enable
        //s->set_wb_mode(s, 0);         // 0 to 4 - if awb_gain enabled (0 - Auto, 1 - Sunny, 2 - Cloudy, 3 - Office, 4 - Home)
        //s->set_exposure_ctrl(s, 1);   // 0 = disable , 1 = enable
        //s->set_aec2(s, 0);            // 0 = disable , 1 = enable
        //s->set_ae_level(s, 0);        // -2 to 2
        //s->set_aec_value(s, 300);     // 0 to 1200
        //s->set_gain_ctrl(s, 1);       // 0 = disable , 1 = enable
        //s->set_agc_gain(s, 0);        // 0 to 30
        //s->set_gainceiling(s, (gainceiling_t)0);  // 0 to 6
        //s->set_bpc(s, 0);             // 0 = disable , 1 = enable
        //s->set_wpc(s, 1);             // 0 = disable , 1 = enable
        //s->set_raw_gma(s, 1);         // 0 = disable , 1 = enable
        //s->set_lenc(s, 1);            // 0 = disable , 1 = enable
        //s->set_hmirror(s, 0);         // 0 = disable , 1 = enable
        //s->set_vflip(s, 0);           // 0 = disable , 1 = enable
        //s->set_dcw(s, 1);             // 0 = disable , 1 = enable
        //s->set_colorbar(s, 0);        // 0 = disable , 1 = enable
        // We now have camera with default init
        // check for saved preferences and apply them
        if (filesystem) {
            filesystemStart();
            loadPrefs(SPIFFS);
        } else {
            Serial.println("No Internal Filesystem, cannot load or save preferences");
        }
    }

    /*
     * Camera setup complete; initialise the rest of the hardware.
     */

    // Initialise and set the lamp
    if (lampBrightnessPercentage != -1) {
#if defined(LAMP_PIN)
#  if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
        ledcAttachChannel(LAMP_PIN, lampPWMFrequency, lampPWMResolution, lampChannel); // New API - 2 channels share same timer and resolution
#  else
        ledcSetup(lampChannel, lampPWMFrequency, lampPWMResolution);  // configure LED PWM channel
        ledcAttachPin(LAMP_PIN, lampChannel);            // attach the GPIO pin to the channel
#  endif
#endif
        if (autoLampValue) {
            setLamp(0);                        // set default value
        } else {
            setLamp(lampBrightnessPercentage);
        }

    } else {
        Serial.println("No lamp, or lamp disabled in config");
    }

    // Having got this far; start Wifi and loop until we are connected or have started an AccessPoint
    while ((WiFi.status() != WL_CONNECTED) && !sInAccesspointMode) {
        WifiSetup();
        delay(1000);
    }

    if (otaEnabled) {
        // Start OTA once connected
        Serial.println("Setting up OTA");
        // Port defaults to 3232
        // ArduinoOTA.setPort(3232); 
        // Hostname defaults to esp3232-[MAC]
        ArduinoOTA.setHostname(sApplicationName);
        // No authentication by default
        ArduinoOTA.setPort(3232); // Required for Sloeber
        if (strlen(otaPassword) != 0) {
            ArduinoOTA.setPassword(otaPassword);
            Serial.printf("OTA Password: %s\n\r", otaPassword);
        } else {
            Serial.printf("\r\nNo OTA password has been set! (insecure)\r\n\r\n");
        }
        ArduinoOTA.onStart([]() {
            String type;
            if (ArduinoOTA.getCommand() == U_FLASH) {
                type = "sketch";
            } else {
                // U_SPIFFS
                type = "filesystem";
            }
            // NOTE: if updating SPIFFS this would be the place to unmount SPIFFS using SPIFFS.end()
            Serial.println("Start updating " + type);
        });
        ArduinoOTA.onEnd([]() {
            Serial.println("\r\nEnd");
        });
        ArduinoOTA.onProgress([](unsigned int progress, unsigned int total) {
            unsigned int tPercent = progress / (total / 100);
            static int sLastPercent;
            if (sLastPercent != tPercent) {
                sLastPercent = tPercent;
                Serial.printf("Progress: %u%%\r\n", tPercent);
            }
        });
        ArduinoOTA.onError([](ota_error_t error) {
            Serial.printf("Error[%u]: ", error);
            if (error == OTA_AUTH_ERROR)
                Serial.println("Auth Failed");
            else if (error == OTA_BEGIN_ERROR)
                Serial.println("Begin Failed");
            else if (error == OTA_CONNECT_ERROR)
                Serial.println("Connect Failed");
            else if (error == OTA_RECEIVE_ERROR)
                Serial.println("Receive Failed");
            else if (error == OTA_END_ERROR)
                Serial.println("End Failed");
        });
        ArduinoOTA.begin();
    } else {
        Serial.println("OTA is disabled");
    }

    // Set time via NTP server when enabled
    if (haveTime) {
        Serial.print("Time: ");
        configTime(gmtOffset_sec, daylightOffset_sec, ntpServer);
        printLocalTime(true);
    } else {
        Serial.println("Time functions disabled");
    }

    // Now we have a network we can start the two http handlers for the UI and Stream.
    startCameraServer(httpPort, streamPort);

    if (critERR.length() == 0) {
        Serial.printf("\r\nCamera Ready!\r\nUse '%s' to connect\r\n", httpURL);
        Serial.printf("Stream viewer available at '%sview'\r\n", streamURL);
        Serial.printf("Raw stream URL is '%s'\r\n", streamURL);
#if defined(DEBUG_DEFAULT_ON)
        debugOn();
#else
        debugOff();
#endif
    } else {
        Serial.printf("\r\nCamera unavailable due to initialization errors.\r\n\r\n");
    }

    // Used when dumping status; these are slow functions, so just do them once during startup
    sketchSize = ESP.getSketchSize();
    sketchSpace = ESP.getFreeSketchSpace();
    sketchMD5 = ESP.getSketchMD5();

    // As a final init step chomp out the serial buffer in case we have recieved mis-keys or garbage during startup
    while (Serial.available()) {
        Serial.read();
    }

    initServoAndMotorPinsAndChannels(sInAccesspointMode);

