ArminJo/ESP32-Cam-Sewer-inspection-car/ESP32-Cam-Sewer-inspection-car/ESP32-Cam-Sewer-inspection-car.ino
    // While in Beta; Warn!
    Serial.print("\r\nThis is the 4.0 alpha\r\n - Face detection has been removed!\r\n");
}

void loop() {
    /* 
     *  Just loop forever, reconnecting Wifi As necessary in client mode
     * The stream and URI handler processes initiated by the startCameraServer() call at the
     * end of setup() will handle the camera and UI processing from now on.
     */
    if (sInAccesspointMode) {
        // Accespoint is permanently up, so just loop, servicing the captive portal as needed
        // Rather than loop forever, follow the watchdog, in case we later add auto re-scan.
        unsigned long start = millis();
        while (millis() - start < WIFI_WATCHDOG) {
            delay(100);
            if (otaEnabled) {
                ArduinoOTA.handle();
            }
            handleSerial();
            updateMotor();
            checkForAttention();
            if (sCaptivePortalEnabled) {
                dnsServer.processNextRequest();
            }
        }
    } else {
        // client mode can fail; so reconnect as appropriate 
        static bool warned = false;
        if (WiFi.status() == WL_CONNECTED) {
            // We are connected, wait a bit and re-check
            if (warned) {
                // Tell the user if we have just reconnected 
                Serial.println("WiFi reconnected");
                warned = false;
            }
            // loop here for WIFI_WATCHDOG, turning debugData true/false depending on serial input..
            unsigned long start = millis();
            while (millis() - start < WIFI_WATCHDOG) {
                delay(100);
                if (otaEnabled) {
                    ArduinoOTA.handle();
                }
                handleSerial();
                updateMotor();
                checkForAttention();
            }
        } else {
            /*
             * disconnected; attempt to reconnect
             */
            if (!warned) {
                // Tell the user if we just disconnected
                WiFi.disconnect();  // ensures disconnect is complete, wifi scan cleared
                Serial.println("WiFi disconnected, retrying");
                warned = true;
            }
            WifiSetup();
        }
    }
}
